Repository: mengzhisuoliu/FluentCleaner
Catalog: FluentCleaner/Strings/*/Resources.resw
Source language: en_us
Languages: it_it, lt_lt, nb_no, pt_br, ru_ru, uk_ua

# St_CustomRunning
source: Running {0}...
it_it: Avviato {0}...
lt_lt: Vykdoma {0}...
nb_no: Kjører {0}...
pt_br: Executando {0}...
ru_ru: Выполнение {0}...
uk_ua: Виконання {0}...

# St_CustomScriptError
source: {0}: could not read script — {1}
it_it: {0}: Impossibile leggere lo script — {1}
lt_lt: {0}: nepavyko perskaityti scenarijaus — {1}
nb_no: {0}: kunne ikke lese skript — {1}
pt_br: {0}: não possível ler o script — {1}
ru_ru: {0}: не удалось прочитать скрипт — {1}
uk_ua: {0}: не вдалося прочитати скрипт — {1}

# St_CustomCompleted
source: {0}: completed successfully.
it_it: {0}: completato con successo.
lt_lt: {0}: sėkmingai užbaigta.
nb_no: {0}: fullført.
pt_br: {0}: concluído com sucesso.
ru_ru: {0}: успешно завершено.
uk_ua: {0}: успішно завершено.

# St_CustomFailed
source: {0}: failed (exit {1}).
it_it: {0}: fallito (uscita {1}).
lt_lt: {0}: nepavyko (kodas {1}).
nb_no: {0}: mislyktes (avslutningskode {1}).
pt_br: {0}: falha (saída {1}).
ru_ru: {0}: ошибка (код {1}).
uk_ua: {0}: Помилка (код {1}).

# St_CustomEntryNone
source: no entries parsed
it_it: nessuna voce analizzata
lt_lt: nėra išanalizuotų įrašų
nb_no: ingen oppføringer tolket
pt_br: nenhuma entrada analisada
ru_ru: записей не найдено
uk_ua: записів не знайдено

# St_CustomEntryOne
source: 1 entry · {0}
it_it: 1 elemento · {0}
lt_lt: 1 įrašas · {0}
nb_no: 1 oppføring · {0}
pt_br: 1 entrada · {0}
ru_ru: 1 запись · {0}
uk_ua: 1 запис · {0}

# St_CustomEntryMany
source: {0} entries · {1}
it_it: {0} elementi· {1}
lt_lt: {0} įrašas(-ai) · {1}
nb_no: {0} oppføringer · {1}
pt_br: {0} entradas · {1}
ru_ru: {0} записей · {1}
uk_ua: {0} записів · {1}

# St_CustomEntryEnabled
source: enabled
it_it: abilitato
lt_lt: įjungta
nb_no: aktivert
pt_br: ativado
ru_ru: включено
uk_ua: ввімкнено

# St_CustomEntryDisabled
source: disabled
it_it: disabilitato
lt_lt: išjungta
nb_no: deaktivert
pt_br: desativado
ru_ru: отключено
uk_ua: вимкнено

# DlgNewCleanerSave
source: Save
it_it: Salva
lt_lt: Išsaugoti
nb_no: Lagre
pt_br: Salvar
ru_ru: Сохранить
uk_ua: Зберегти

# DlgNewCleanerCancel
source: Cancel
it_it: Annulla
lt_lt: Atšaukti
nb_no: Avbryt
pt_br: Cancelar
ru_ru: Отмена
uk_ua: Відміна

# DlgNewCleanerTypeIni.Content
source: Winapp2 entry (.ini)
it_it: Elementi in Winapp2 (.ini)
lt_lt: „Winapp2“ įrašas (.ini)
nb_no: Winapp2-oppføring (.ini)
pt_br: Entrada do Winapp2 (.ini)
ru_ru: Запись Winapp2 (.ini)
uk_ua: запис Winapp2 (.ini)

# DlgNewCleanerTypePs1.Content
source: PowerShell script (.ps1)
it_it: Script PowerShell (.ps1)
lt_lt: „PowerShell“ skriptas (.ps1)
nb_no: PowerShell-skript (.ps1)
pt_br: Script do PowerShell (.ps1)
ru_ru: Скрипт PowerShell (.ps1)
uk_ua: Скрипт PowerShell (.ps1)

# DlgNewCleanerNameHeader
source: Name
it_it: Nome
lt_lt: Pavadinimas
nb_no: Navn
pt_br: Nome
ru_ru: Имя
uk_ua: Ім'я

# DlgNewCleanerNamePlaceholder
source: My Cleaner
it_it: Mio Pulitore
lt_lt: Mano valytuvas
nb_no: Min renser
pt_br: Meu Limpador
ru_ru: Мой очиститель
uk_ua: Мій очищувач

# DlgNewCleanerAiPlaceholder
source: Generate with AI - describe what to clean (results may vary)
it_it: Genera con l'IA: descrivi cosa pulire (i risultati possono variare)
lt_lt: Generuoti su DI - aprašykite, ką valyti (rezultatai gali skirtis)
nb_no: Generer med AI – beskriv hva som skal renses (resultatene kan variere)
pt_br: Gerar com IA – descreva o que limpar (os resultados podem variar)
ru_ru: Сгенерировать с ИИ — опишите, что нужно очистить (результаты могут различаться)
uk_ua: Згенерувати з ШІ - опишіть, що потрібно Очистити (результати можуть відрізнятися)

# DlgNewCleanerGenerate.Content
source: Generate
it_it: Genera
lt_lt: Generuoti
nb_no: Generer
pt_br: Gerar
ru_ru: Сгенерировать
uk_ua: Згенерувати

# DlgNewCleanerContentLabel
source: Content
it_it: Contenuto
lt_lt: Turinys
nb_no: Innhold
pt_br: Conteúdo
ru_ru: Содержимое
uk_ua: Вміст

# DlgNewCleanerLoadTemplate.Content
source: Load template
it_it: Carica modello
lt_lt: Įkelti šabloną
nb_no: Last inn mal
pt_br: Carregar modelo
ru_ru: Загрузить шаблон
uk_ua: Завантажити шаблон

# DlgNewCleanerTitleNew
source: New custom cleaner
it_it: Nuovo pulitore personalizzato
lt_lt: Naujas custom cleaner
nb_no: Ny egendefinert renser
pt_br: Novo limpador personalizado
ru_ru: Новый пользовательский очиститель
uk_ua: Новий користувацький очищувач

# DlgNewCleanerTitleEdit
source: Edit — {0}
it_it: Modifica — {0}
lt_lt: Redaguoti — {0}
nb_no: Rediger — {0}
pt_br: Editar — {0}
ru_ru: Редактирование — {0}
uk_ua: Редагування — {0}

# AI_NoKey
source: No API key configured. Go to Settings → AI explanations to add your Groq API key (free at console.groq.com).
it_it: Nessuna chiave API configurata. Vai su Impostazioni → Spiegazioni IA per aggiungere la tua chiave API Groq (gratuita su console.groq.com).
lt_lt: Nesukonfigūruotas API raktas. Eikite į Parametrai → DI paaiškinimai ir pridėkite „Groq API“ raktą (gaunamas nemokamai puslapyje console.groq.com).
nb_no: Ingen API-nøkkel konfigurert. Gå til Innstillinger → AI-forklaringer for å legge til din Groq API-nøkkel (gratis på console.groq.com).
pt_br: Nenhuma chave API configurada. Vá para Configurações → Explicações da IA para adicionar sua chave API Groq (grátis em console.groq.com).
ru_ru: Ключ API не настроен. Перейдите в «Настройки» → «Объяснения ИИ», чтобы добавить ваш ключ Groq API (бесплатно на console.groq.com).
uk_ua: Ключ API не налаштований. Перейдіть до "Налаштування" → "Пояснення ШІ", щоб додати ваш ключ Groq API (безкоштовно на console.groq.com).

# AI_ApiError
source: Groq API error: {0}
it_it: Errore API Groq: {0}
lt_lt: „Groq API“ klaida: {0}
nb_no: Groq API-feil: {0}
pt_br: Erro da API Groq: {0}
ru_ru: Ошибка Groq API: {0}
uk_ua: Помилка Groq API: {0}

# AI_NoResponse
source: No response received.
it_it: Nessuna risposta ricevuta.
lt_lt: Negautas atsakymas.
nb_no: Ingen svar mottatt.
pt_br: Nenhuma resposta recebida.
ru_ru: Ответ не получен.
uk_ua: Відповідь не отримана.

# AI_NetworkError
source: Could not reach Groq API: {0}
it_it: Impossibile raggiungere l'API di Groq: {0}
lt_lt: Nepavyko pasiekti „Groq API“: {0}
nb_no: Kunne ikke nå Groq API: {0}
pt_br: Não foi possível acessar a API Groq: {0}
ru_ru: Не удалось связаться с Groq API: {0}
uk_ua: Не вдалося зв'язатися з Groq API: {0}

# AI_NoKeyShort
source: No API key configured — go to Settings → AI explanations.
it_it: Nessuna chiave API configurata: vai su Impostazioni → Spiegazioni IA.
lt_lt: Nesukonfigūruotas API raktas – eikite į Parametrai → DI paaiškinimai.
nb_no: Ingen API-nøkkel konfigurert — gå til Innstillinger → AI-forklaringer.
pt_br: Nenhuma chave API configurada — vá para Configurações → Explicações da IA.
ru_ru: Ключ API не настроен — перейдите в «Настройки» → «Объяснения ИИ».
uk_ua: Ключ API не налаштований — перейдіть до "Налаштування" → "Пояснення ШІ".

# CLI_Welcome
source: FluentCleaner Terminal online.
it_it: FluentCleaner Terminale online.
lt_lt: „FluentCleaner“ online terminalas.
pt_br: Terminal FluentCleaner online.
ru_ru: Терминал FluentCleaner онлайн.
uk_ua: Термінал FluentCleaner онлайн.

# CLI_Databases
source: Databases: {0} active — {1} detected entries
it_it: Database: {0} attivi — {1} elementi rilevati
lt_lt: Duomenų bazės: {0} aktyvi(-ių) — {1} aptikti įrašai
nb_no: Databaser: {0} aktive — {1} oppdagede oppføringer
pt_br: Bancos de dados: {0} ativo — {1} entradas detectadas
ru_ru: Базы данных: {0} активны — обнаружено {1} записей
uk_ua: Бази данних: {0} активні — виявлено {1} записів

# CLI_HelpHint
source: Type 'help' for commands.
it_it: Digitare 'help' per i comandi.
lt_lt: Įveskite „help“ komandų sąrašui.
nb_no: Skriv 'help' for kommandoer.
pt_br: Digite 'help' para comandos.
ru_ru: Введите 'help' для списка команд.
uk_ua: Введіть 'help' для перегляду списку команд.

# CLI_UnknownCommand
source: Unknown command '{0}'. Type 'help'.
it_it: Comando sconosciuto '{0}'. Digita 'help'.
lt_lt: Nežinoma komanda „{0}“. Įveskite „help“.
nb_no: Ukjent kommando '{0}'. Skriv 'help'.
pt_br: Comando desconhecido '{0}'. Digite 'help'.
ru_ru: Неизвестная команда '{0}'. Введите 'help'.
uk_ua: Невідома команда '{0}'. Введіть 'help'.

# CLI_NoDrives
source: No drives found.
it_it: Nessuna unità trovata.
lt_lt: Diskų nerasta.
nb_no: Ingen stasjoner funnet.
pt_br: Nenhuma unidade encontrada.
ru_ru: Диски не найдены.
uk_ua: Диски не знайдені.

# CLI_ThemeUsage
source: Usage: theme dark | light | system
it_it: Utilizzo: theme dark | light | system
lt_lt: Naudojimas: theme dark | light | system
nb_no: Bruk: theme dark | light | system
pt_br: Uso: theme dark | light | system
ru_ru: Использование: theme dark | light | system
uk_ua: Використання: theme dark | light | system

# CLI_ThemeSet
source: Theme set to '{0}'.
it_it: Tema impostato come '{0}'.
lt_lt: Pasirinkta tema „{0}“.
nb_no: Tema satt til '{0}'.
pt_br: Tema definido para'{0}'.
ru_ru: Тема установлена на '{0}'.
uk_ua: Тема встановлена на '{0}'.

# CLI_BackdropUsage
source: Usage: backdrop mica | acrylic
it_it: Utilizzo: backdrop mica | acrylic
lt_lt: Naudojimas: backdrop mica | acrylic
nb_no: Bruk: backdrop mica | acrylic
pt_br: Uso: backdrop mica | acrylic
ru_ru: Использование: backdrop mica | acrylic
uk_ua: Використання: backdrop mica | acrylic

# CLI_BackdropSet
source: Backdrop set to '{0}'.
it_it: Trasparenza impostata su '{0}'.
lt_lt: Pasirinktas fonas „{0}“.
nb_no: Bakgrunn satt til '{0}'.
pt_br: Fundo definido para '{0}'.
ru_ru: Фон установлен на '{0}'.
uk_ua: Фон встановлений на '{0}'.

# CLI_NoMatch
source: No entries matching '{0}'.
it_it: Nessuna corrispondenza trovata '{0}'.
lt_lt: Nėra atitinkančių įrašų „{0}“.
nb_no: Ingen oppføringer samsvarer med '{0}'.
pt_br: Nenhuma entrada correspondente '{0}'.
ru_ru: Записей, соответствующих '{0}', не найдено.
uk_ua: записів, відповідних '{0}', не знайдено.

# CLI_CleanEntry
source: {0}: {1} items · {2}
it_it: {0}: {1} elementi · {2}
lt_lt: {0}: {1} įrašas(-ai) · {2}
nb_no: {0}: {1} elementer · {2}
pt_br: {0}: {1} itens · {2}
ru_ru: {0}: {1} элементов · {2}
uk_ua: {0}: {1} елементів · {2}

# CLI_CleanDone
source: Done — {0} items removed · {1} freed.
it_it: Completato — {0} elementi rimossi · {1} liberati.
lt_lt: Atlikta — {0} įrašų pašalintas(-a) · {1} atlaisvintas(-a).
nb_no: Fullført — {0} elementer fjernet · {1} frigjort.
pt_br: Done — {0} itens removidos · {1} limpos.
ru_ru: Готово — удалено {0} элементов · освобождено {1}.
uk_ua: Готово — видалено {0} елементів · освобождено {1}.

# CLI_NothingToClean
source: Nothing to clean.
it_it: Nulla da pulire.
lt_lt: Nėra ką valyti.
nb_no: Ingenting å rense.
pt_br: Nada para limpar.
ru_ru: Нечего очищать.
uk_ua: Нічого очищати.

# CLI_AnalyzeEntry
source: {0}: {1} files · {2} registry · {3}
it_it: {0}: {1} file · {2} registro · {3}
lt_lt: {0}: {1} failas(-ai) · {2} registras · {3}
nb_no: {0}: {1} filer · {2} register · {3}
pt_br: {0}: {1} arquivos · {2} registro · {3}
ru_ru: {0}: {1} файлов · {2} записей реестра · {3}
uk_ua: {0}: {1} файлів · {2} записів Реєстра · {3}

# CLI_AnalyzeTotal
source: Total: {0} found.
it_it: Totale: {0} trovati.
lt_lt: Iš viso: {0} rasta.
nb_no: Totalt: {0} funnet.
pt_br: Total: {0} encontrados.
ru_ru: Всего: {0} найдено.
uk_ua: Всього: {0} знайдено.

# CLI_NothingFound
source: Nothing found.
it_it: Nessun risultato trovato.
lt_lt: Nieko nerasta.
nb_no: Ingenting funnet.
pt_br: Nada encontrado.
ru_ru: Ничего не найдено.
uk_ua: Нічого не знайдено.

# CLI_ListEntries
source: — {0} entries.
it_it: — {0} elementi.
lt_lt: — {0} įrašas(-ai).
nb_no: — {0} oppføringer.
pt_br: — {0} entradas.
ru_ru: — {0} записей.
uk_ua: — {0} записів.

# CLI_ListCategories
source: — {0} categories.
it_it: — {0} categorie.
lt_lt: — {0} kategorija(-os).
nb_no: — {0} kategorier.
pt_br: — {0} categorias.
ru_ru: — {0} категорий.
uk_ua: — {0} категорій.

# CLI_AppxUsage
source: Usage: appx list | appx scan | appx remove <name> | appx remove all
it_it: Utilizzo: appx list | appx scan | appx remove <name> | appx remove all
lt_lt: Naudojimas: appx list | appx scan | appx remove <name> | appx remove all
nb_no: Bruk: appx list | appx scan | appx remove <navn> | appx remove all
pt_br: Uso: appx list | appx scan | appx remove <name> | appx remove all
ru_ru: Использование: appx list | appx scan | appx remove <имя> | appx remove all
uk_ua: Використання: appx list | appx scan | appx remove <Ім'я> | appx remove all

# CLI_AppxListStart
source: Listing all installed AppX packages...
it_it: Elenco di tutti i pacchetti AppX installati...
lt_lt: Kuriamas įdiegtų AppX paketų sarąšas...
nb_no: Lister opp alle installerte AppX-pakker...
pt_br: Listando todos os pacotes AppX instalados...
ru_ru: Список всех установленных пакетов AppX...
uk_ua: Список всіх встановлених пакетів AppX...

# CLI_AppxNoPackages
source: No packages found.
it_it: Nessun pacchetto trovato.
lt_lt: Paketų nerasta.
nb_no: Ingen pakker funnet.
pt_br: Nenhum pacote encontrado.
ru_ru: Пакетов не найдено.
uk_ua: Пакетів не знайдено.

# CLI_AppxListDone
source: — {0} package(s) installed. Use 'appx remove <name>' to uninstall.
it_it: — {0} pacchetto(i) installato(i). Utilizza 'appx remove <name>' per disinstallarlo.
lt_lt: — {0} paketas(-ų) įdiegtas(-a). Naudokite „appx remove <name>“ išdiegimui.
nb_no: — {0} pakke(r) installert. Bruk 'appx remove <navn>' for å avinstallere.
pt_br: — {0} pacote(s) instalado(s). Use 'appx remove <name>' para desinstalar.
ru_ru: — {0} пакет(ов) установлено. Используйте 'appx remove <имя>' для удаления.
uk_ua: — {0} пакет(ів) встановлено. Используйте 'appx remove <Ім'я>' для видалення.

# CLI_AppxScanStart
source: Scanning installed packages...
it_it: Scansione dei pacchetti installati...
lt_lt: Ieškoma įdiegtų paketų...
nb_no: Skanner installerte pakker...
pt_br: Verificando pacotes instalados...
ru_ru: Сканирование установленных пакетов...
uk_ua: Сканування встановлених пакетів...

# CLI_AppxNothingFound
source: Nothing found — system looks clean.
it_it: Nessun risultato trovato: il sistema sembra pulito..
lt_lt: Nieko nerasta — sistema atrodo švari.
nb_no: Ingenting funnet — systemet ser rent ut.
pt_br: Nada encontrado — o sistema parece limpo.
ru_ru: Ничего не найдено — система чистая.
uk_ua: Нічого не знайдено – система чиста.

# CLI_AppxScanDone
source: — {0} package(s) found. Use 'appx remove <name>' or 'appx remove all'.
it_it: — {0} pacchetto(i) trovato(i). Utilizza 'appx remove <name>' oppure 'appx remove all'.
lt_lt: — {0} paketas(-ų) rastas(-a). Naudokite „appx remove <name>“ ar „appx remove all“.
nb_no: — {0} pakke(r) funnet. Bruk 'appx remove <navn>' eller 'appx remove all'.
pt_br: — {0} pacote(s) encontrado(s). Use 'appx remove <name>' ou 'appx remove all'.
ru_ru: — {0} пакет(ов) найдено. Используйте 'appx remove <имя>' или 'appx remove all'.
uk_ua: — {0} пакет(ів) знайдено. Используйте 'appx remove <Ім'я>' або 'appx remove all'.

# CLI_AppxRemoveUsage
source: Usage: appx remove <name> | appx remove all
it_it: Utilizzo: appx remove <name> | appx remove all
lt_lt: Naudojimas: appx remove <name> | appx remove all
nb_no: Bruk: appx remove <navn> | appx remove all
ru_ru: Использование: appx remove <имя> | appx remove all
uk_ua: Використання: appx remove <Ім'я> | appx remove all

# CLI_AppxRemoveScanStart
source: Scanning for installed packages...
it_it: Ricerca dei pacchetti installati...
lt_lt: Ieškoma įdiegtų paketų...
nb_no: Skanner etter installerte pakker...
pt_br: Verificando pacotes instalados...
ru_ru: Сканирование установленных пакетов...
uk_ua: Сканування встановлених пакетів...

# CLI_AppxNothingToRemove
source: Nothing to remove.
it_it: Niente da rimuovere.
lt_lt: Nėra ką pašalinti.
nb_no: Ingenting å fjerne.
pt_br: Nada para remover.
ru_ru: Нечего удалять.
uk_ua: Нічого видаляти.

# CLI_AppxRemoving
source: Removing {0}...
it_it: Rimozione di {0}...
lt_lt: Šalinama {0}...
nb_no: Fjerner {0}...
pt_br: Removendo0}...
ru_ru: Удаление {0}...
uk_ua: Видалення {0}...

# CLI_AppxRemoveOk
source: OK {0} removed.
it_it: OK {0} rimosso.
lt_lt: OK {0} pašalintas(-a).
nb_no: OK {0} fjernet.
pt_br: OK {0} removido.
ru_ru: OK {0} удалён.
uk_ua: OK {0} видалений.

# CLI_AppxRemoveErr
source: ERR {0} — failed (may not be installed or requires elevation).
it_it: ERR {0} — fallito (potrebbe non essere installato o richiede un'elevazione).
lt_lt: KLAIDA {0} — nepavyko (gali būti neįdiegta arba reikia administratoriaus teisių).
nb_no: ERR {0} — mislyktes (kanskje ikke installert, eller krever administratorrettigheter).
pt_br: ERR {0} — falha (pode não estar instalado ou requer elevação).
ru_ru: ОШИБКА {0} — не удалось (возможно, не установлен или требует прав администратора).
uk_ua: Помилка {0} — не вдалося (можливо, не встановлено або потребує прав адміністратора).

# CLI_AppxRemoveDone
source: Done — {0} package(s) removed.
it_it: Completato — {0} pacchetto(i) rimosso(i).
lt_lt: Baigta — {0} paketas(-ų) pašalintas(-a).
nb_no: Fullført — {0} pakke(r) fjernet.
pt_br: Concluído — {0} pacote(s) removido(s).
ru_ru: Готово — удалено {0} пакет(ов).
uk_ua: Готово — видалено {0} пакет(ів).

# CLI_AppxNothingRemoved
source: Nothing was removed.
it_it: Non è stato rimosso nulla..
lt_lt: Nieko nepašalinta.
nb_no: Ingenting ble fjernet.
pt_br: Nada foi removido.
ru_ru: Ничего не было удалено.
uk_ua: Нічого не було видалено.

# CLI_AppxDisabled
source: Winappx database is disabled — enable it in Settings.
it_it: Il database Winappx è disabilitato — abilitalo nelle Impostazioni..
lt_lt: „Winappx“ DB išjungta – įjunkite ją parametruose.
nb_no: Winappx-databasen er deaktivert — aktiver den i Innstillinger.
pt_br: O banco de dados Winappx está desativado — ative-o em Configurações.
ru_ru: База данных Winappx отключена — включите её в «Настройках».
uk_ua: База данних Winappx вимкнена — увімкніть її в «Налаштуваннях».

# CLI_AppxNotFound
source: Winappx.ini not found — download it in Settings.
it_it: Winappx.ini non trovato — scaricalo dalle Impostazioni.
lt_lt: „Winappx.ini“ nerastas — atsisiųskite jį parametruose.
nb_no: Winappx.ini ikke funnet — last den ned i Innstillinger.
pt_br: Winappx.ini não encontrado — baixe-o em Configurações.
ru_ru: Winappx.ini не найден — скачайте его в «Настройках».
uk_ua: Winappx.ini не знайдено — скачайте його в «Налаштуваннях».

# LblCopyright.Text
source: © 2026 A Belim app creation
pt_br: © 2026 Uma aplicativo criado por Belim
ru_ru: © 2026 Создание приложения Belim
uk_ua: © 2026 Створення додатку Belim

# TerminalPlaceholder.PlaceholderText
source: clean firefox · analyze chrome · help
it_it: pulisci firefox · analizza chrome · aiuto
pt_br: limpar Firefox · analisar Chrome · ajuda
